[
    {
        "domain": "www.google.com",
        "next_page_id": null,
        "url": "http://www.google.com/",
        "short_url": "http://rdd.me/ch9hmdt9",
        "author": null,
        "excerpt": "Advanced searchLanguage toolsAdvertising ProgramsBusiness Solutions+GoogleAbout Google© 2016 - Privacy - Term",
        "direction": "ltr",
        "word_count": 9,
        "total_pages": 0,
        "content": "<div><br clear=\"all\" id=\"lgpd\"><div id=\"lga\"><img alt=\"Google\" src=\"http://www.google.com/images/branding/googlelogo/1x/googlelogo_white_background_color_272x92dp.png\" width=\"272\" id=\"hplogo\"></div><table cellpadding=\"0\" cellspacing=\"0\"><tr valign=\"top\"><td width=\"25%\"> </td><td nowrap><br></td><td class=\"fl sblc\" nowrap width=\"25%\"><a href=\"http://www.google.com/advanced_search?hl=en&amp;authuser=0\">Advanced search</a><a href=\"http://www.google.com/language_tools?hl=en&amp;authuser=0\">Language tools</a></td></tr></table><p id=\"footer\"><div><div id=\"fll\"><a href=\"http://www.google.com/intl/en/ads/\">Advertising Programs</a><a href=\"http://www.google.com/services/\">Business Solutions</a><a href=\"https://plus.google.com/116899029375914044550\" rel=\"publisher\">+Google</a><a href=\"http://www.google.com/intl/en/about.html\">About Google</a></div></div><p>© 2016 - <a href=\"http://www.google.com/intl/en/policies/privacy/\">Privacy</a> - <a href=\"http://www.google.com/intl/en/policies/terms/\">Terms</a></p></p></div>",
        "date_published": null,
        "dek": null,
        "lead_image_url": "http://www.google.com/images/branding/googlelogo/1x/googlelogo_white_background_color_272x92dp.png",
        "title": "Google",
        "rendered_pages": 1
    },
    {
      "domain": "www.wired.com",
      "next_page_id": null,
      "url": "http://www.wired.com/2016/07/chef-david-chang-on-deliciousness/",
      "short_url": "http://rdd.me/tq1bcasb",
      "author": null,
      "excerpt": "A few years ago I got really into experimenting with fermentation. Miso is made by fermenting soybeans, but I wanted to see what happens when you ferment nuts, seeds, and other legumes. It turns out&hellip;",
      "direction": "ltr",
      "word_count": 664,
      "total_pages": 0,
      "content": "<div><div class=\"exchange fsb-content relative\">\n<div class=\"hide-mob hide-sm ambroise drop-cap marg-r-med a\"><img src=\"https://www.wired.com/wp-content/uploads/2016/07/Chang_Drop_A.svg\" alt=\"Chang_Drop_A.svg\" width=\"100%\" class=\"alignnone size-large wp-image-2058423\"></div>\n<p><span class=\"drop-cap-letter hide-med hide-big lede\">A</span><span class=\"lede\"> few years</span> ago I got really into experimenting with fermentation. Miso is made by fermenting soybeans, but I wanted to see what happens when you ferment nuts, seeds, and other legumes. It turns out you can get some really delicious flavors. I particularly loved the flavor I was able to get from fermenting chickpeas. I called the result a chickpea hozon, a word I invented because it wasn&#x2019;t technically miso.</p>\n<p>It proved to be a really versatile ingredient. I served it with sea urchin at my restaurant Ko, and we made a killer dish that used it on sardine toasts at Ss&#xE4;m Bar. The more time I spent with it, the more I realized it had some of the umami of a soybean miso but a sweetness that reminded me of pecorino Romano.</p>\n<p>That got me wondering if I could use it to create a new version of a classic dish, cacio e pepe. Everyone loves cacio e pepe. It&#x2019;s simple: pasta with pepper, olive oil, and pecorino Romano cheese. There are only four ingredients, but with those ingredients you get this great interplay of saltiness, the chewiness of the noodles, a little prick of heat from the pepper, and the velvetiness of the fat. At heart, though, cacio e pepe is a vehicle for glutamic acid, which comes from the pecorino. It&#x2019;s an umami bomb. So we made ceci e pepe (<em>ceci</em> is Italian for chickpeas), keeping the pepper and the pasta, using butter instead of oil, and replacing the pecorino Romano with chickpea hozon.</p>\n\n\n<p>In and of itself, this kind of idea isn&#x2019;t particularly unique. Lots of cooks strip a dish down to its component flavors and re-create them in different ways. That&#x2019;s the whole concept behind deconstructed dishes. But where this gets really exciting is when you realize that many dishes from around the world share some of these base patterns, and by reverse-engineering one of these dishes you can actually tap into many of them at the same time.</p>\n<p>This is easier to see in retrospect than to plan out in advance. For instance, I inadvertently stumbled on a hit again in 2006, after I hired Joshua McFadden from the Italian restaurant Lupa. (He has since gone on to greatness in Portland, Oregon, at Ava Gene&#x2019;s.) Joshua told me he wanted to make a version of a Bolognese, the Italian meat sauce. I told him that was fine, but he had to use only Korean ingredients. I often set these kinds of limitations, because I&#x2019;m a big believer that creativity comes from working within constraints. (And also, maybe it&#x2019;s a form of payback; when I was a kid in northern Virginia, my mother had to make her Korean dishes using only ingredients she could find at the local Safeway.)</p>\n<p>Anyway, that meant he would have to find a way of re-creating the sweetness, umami, and pungency of Bolognese without the onions, celery, carrot, tomato paste, or white wine. He ended up using scallions, red chiles, ground pork, and fermented bean paste. Instead of using milk to provide that silky mouthfeel, I encouraged him to add in some whipped tofu. And rather than pasta or gnocchi, he served it with rice cakes that looked like gnocchi. We called it Spicy Pork Sausage &amp; Rice Cakes, and when most people taste it, it reminds them&#x2014;even on a subconscious level&#x2014;of a spicier version of Bolognese.</p>\n<p>But here&#x2019;s the thing. When I taste that dish, I don&#x2019;t taste Bolognese&#x2014;I taste mapo tofu, a spicy, flavorful Chinese dish made with soft tofu, Szechuan peppers, and ground pork. I&#x2019;ve had way more mapo tofu than I&#x2019;ve had Bolognese, so that resonates more for me. I&#x2019;d never seen a connection between Bolognese and mapo tofu before, but Joshua had inadvertently discovered this overlap between them. We hit the middle of a Venn diagram, creating something that incorporated enough elements of both mapo tofu and Bolognese that it could evoke both of them, while being neither one precisely.</p>\n</div>\n</div>",
      "date_published": "2016-07-19 00:00:00",
      "dek": null,
      "lead_image_url": "https://www.wired.com/wp-content/uploads/2016/07/Chang_Drop_A.svg",
      "title": "David Chang’s Unified Theory of Deliciousness",
      "rendered_pages": 1
    },
    {
      "domain": "apptimize.com",
      "next_page_id": null,
      "url": "https://apptimize.com/blog/2016/10/trigger-aha-moments-across-customer-journey/",
      "short_url": "http://rdd.me/gi3citpa",
      "author": "Yinmeng Zhang",
      "excerpt": "Conventional wisdom says that once you drive users to the core action of your app&#x2014;the aha! moment, when they discover the value of the app for the first time&#x2014;you&#x2019;re golden. Show&hellip;",
      "direction": "ltr",
      "word_count": 1176,
      "total_pages": 0,
      "content": "<div><div class=\"entry-content\"><p>Conventional wisdom says that once you drive users to the core action of your app&#x2014;the aha! moment, when they discover the value of the app for the first time&#x2014;you&#x2019;re golden. Show them the value, and they&#x2019;ll come back for more.</p><p>The problem is that there is a chasm between a user getting to an aha! moment once, and true engagement. To build an app that people love and return to, you need to continuously trigger aha! moments over the entire customer journey.&#xA0;</p><h2>The Mobile Hierarchy of Engagement</h2><p><img src=\"https://apptimize.com/wp-content/uploads/2016/10/hiearchy-of-engagement.jpeg\" alt=\"Hiearchy of Engagment Sarah Tavel\" width=\"880\" class=\"aligncenter size-full wp-image-14884\"></p><p>(Source: <a href=\"https://news.greylock.com/the-hierarchy-of-engagement-5803bf4e6cfa#.bbsayma9b\">Greylock</a>)</p><p>According to Sarah Tavel, a partner at Greylock, the hierarchy of engagement for the most successful consumer apps follows <a href=\"https://news.greylock.com/the-hierarchy-of-engagement-5803bf4e6cfa#.osts19pp7\">three levels</a>:</p><ol><li><strong>Growth</strong>: Users complete your app&#x2019;s core action, and realize the value of your app. On Pinterest this would occur when you pin an image for the first time.</li><li><strong>Retention</strong>: The product gets better the more it&#x2019;s used over time. The more friends you add on Facebook, the more people like the photos and news articles you share.</li><li><strong>Self-Perpetuation</strong>: Users engage and create virtuous loops in product, leading to even more usage. Retweeting a tweet on Twitter, for example, means that the tweet is shared with your followers, who can share it with their followers.</li></ol><p>Once users have <a href=\"https://apptimize.com/blog/2016/02/this-is-how-you-find-your-apps-aha-moment/\">completed your core action</a>, your focus should be entirely on Level 2 of the pyramid&#x2014;retention. As you reach&#xA0;a critical mass of users completing your core action, you have to get them to stick around to survive.</p><p>Retention on mobile is hard. Your users have limited real-estate on their home screens, and you need to wage war for every half-inch. For consumer apps, the most important factor for retention is that the mobile app gets better the more it&#x2019;s used. For Tavel, this means that an app has:</p><ul><li><strong>accrued benefits:</strong>the more you use a product, the better it gets</li><li><strong>mounting losses: </strong>the more you use a product, the more you lose if you leave it</li></ul><p>Let&#x2019;s look at the accruing benefits and mounting losses for some of the most successful mobile apps out there, and how you can build them into your own engagement loops for your mobile app.</p><h2>1. Build retention hooks into your core action</h2><p> The core action of Snapchat is the ability to send a photo, drawing, or video to friends. But what separates Snapchat from the mass of other messaging apps out there is its self-destruct feature for each message you send. As UX guru Nir Eyal writes,&#xA0;&#x201C;the self- destruct feature encourages timely responses, leading to a back-and-forth relay that&#xA0;<a href=\"http://www.nirandfar.com/hooked\">keeps people hooked</a>.&#x201D;</p><p>The moment after you take a picture on Snapchat, the next screen that appears is an address book populated by recent contacts:</p><p><img src=\"https://apptimize.com/wp-content/uploads/2016/10/snapchat.png\" alt=\"snapchat\" width=\"1024\" class=\"aligncenter size-full wp-image-14883\"></p><p>The more messages you send, the more you appear in your friends&#x2019; recent contacts, and the more messages they send back.&#xA0;</p><ul><li><strong>accrued benefits: </strong>The more messages you send with Snapchat, the more messages you receive.</li><li><strong>mounting losses: </strong>Delete Snapchat, and you suddenly lose access to a world of photos, drawings, and videos that your friends send to you on a daily basis. If you download the app again three months later, you&#x2019;ve missed out on a lot.</li></ul><p>With the launch of additional features like Stories and Discover, Snapchat builds on top of its core engagement hook. Stories only last for 24 hours, so users have to return to the app or the moment passes.</p><h2>2. Personalize your mobile app</h2><p> What makes Netflix special is its huge catalogue of content that allows users to watch what they want, when they want it.</p><p>But as one Netflix engineer pointed out, &#x201C;humans are surprisingly&#xA0;<a href=\"http://dl.acm.org/citation.cfm?id=2843948\">bad at choosing</a> between many options, quickly getting overwhelmed&#x2026;.&#x201D; It&#x2019;s a common affliction for users saturated by apps, known as <a href=\"https://apptimize.com/blog/2015/05/decision-fatigue-utilizing-psychology-on-mobile-for-good-or-for-evil/\">decision fatigue</a>.</p><p><img src=\"https://apptimize.com/wp-content/uploads/2016/10/netflix-recommendations.png\" alt=\"Netflix Recommendation Engine\" width=\"400\" class=\"aligncenter size-full wp-image-14882\"></p><p>(source: <a href=\"http://techblog.netflix.com/2012/04/netflix-recommendations-beyond-5-stars.html\">Netflix Engineering Blog</a>)</p><p>Netflix engineers discovered that the crucial aha! moment occurs when they give users something they want to watch within <a href=\"http://dl.acm.org/citation.cfm?id=2843948\">60-90 seconds</a>.</p><p>To get users more personalized content faster, they created a system of&#xA0;&#x201C;rows&#x201D; of similar content, and placed them on the landing page according to how relevant they are to the user&#x2019;s interests based on an algorithm of what that user has already watched and rated.</p><ul><li><strong>accrued benefit:&#xA0;</strong>The more you use Netflix, the more personalized your recommendations are. You spend less time choosing what to watch, and more time actually watching it.</li><li><strong>mounting losses: </strong>Delete Netflix, and you lose access to a highly-customized list of movies you know you&#x2019;ll love.</li></ul><p>For Netflix, these rows of personalized content are key to driving user engagement within the app&#x2014;particularly on a tablet or a phone, where users are generally too impatient to read through summaries or endlessly scroll.</p><h2>3. Create stored value</h2><p> Every time you log in to LinkedIn, you&#x2019;re constantly reminded to improve your online resume by adding the specific skills, jobs, and recommendations&#xA0;that you&#x2019;ve picked up over the course of your professional career.&#xA0;</p><p><img src=\"https://apptimize.com/wp-content/uploads/2016/10/Screenshot-2016-09-27-10.42.47.png\" alt=\"Linkedin Homepage\" width=\"1113\" class=\"aligncenter size-full wp-image-14881\"></p><p>As former product manager at LinkedIn Josh Elman said, &#x201C;If we could get users to enter just a little more information, <a href=\"http://www.nirandfar.com/hooked\">they were more likely to return</a>.&#x201D;&#xA0;</p><p>Doing something like filling out your skills on LinkedIn, means that other people can endorse those skills. Their connections then see that activity, which increases the discoverability of your profile.</p><ul><li><strong>accrued benefits: </strong>The more you use LinkedIn to fill out your profile, the more people actually see your profile, and the more connections you make.&#xA0;</li><li><strong>mounting losses: </strong>Delete&#xA0;your LinkedIn account, and you lose access to all the connections you&#x2019;ve made and endorsements received over the social network&#x2014;along with all the time you&#x2019;ve put into crafting your online resume.</li></ul><p>The more you add to your LinkedIn profile, the more endorsements from professional contacts you can collect, and the more value you gain out of using LinkedIn when looking for a new job, or networking in the day-to-day.</p><h2>4. Make life easier for your users</h2><p> At <a href=\"http://www.businessinsider.com/wechat-breaks-700-million-monthly-active-users-2016-4\">700 million monthly active users</a>, WeChat is China&#x2019;s premier mobile app. It&#x2019;s achieved this by following the biggest law of mobile apps: make things easier for your users.</p><p>300M of those users have their bank accounts tied to WeChat to use the app&#x2019;s mobile payments system. As a16z partner Connie Chan writes, WeChat&#x2019;s Wallet&#xA0;&#x201C;is not a traditional wallet but <a href=\"http://a16z.com/2015/08/06/wechat-china-mobile-first/\">a menu of carefully curated, pre-selected service providers</a> that users can transact with.&#x201D;</p><p><img src=\"https://apptimize.com/wp-content/uploads/2016/10/integratedapptoweb_a16z.png\" alt=\"WeChat UI\" width=\"1024\" class=\"aligncenter size-full wp-image-14880\"></p><p><em>Booking a doctor&#x2019;s appointment on WeChat. </em>(source: <a href=\"http://a16z.com/2015/08/06/wechat-china-mobile-first/\">a16z</a>)</p><p>Chinese users use WeChat to do everything from calling a taxi, buying fruit on the street, pay their credit card bills, and schedule doctor&#x2019;s appointments&#x2014;all through the conveniently central portal of WeChat.&#xA0;</p><ul><li><strong>accrued benefits</strong>: The more you use WeChat, the less you need a wallet and the less you need other apps.</li><li><strong>mounting losses</strong>: Deleting WeChat means your life is less convenient.</li></ul><p>With the launch of chatbots on Facebook Messenger, we&#x2019;re starting to see a similar move towards creating utilities in the West. But what separates the WeChat from Messenger for the moment is that WeChat has a critical mass of users plugged into the utilities on its platform, creating a virtuous loop for other users.</p><h2>Retention Trumps Growth</h2><p><a href=\"https://apptimize.com/blog/2016/08/week-one-retention/\">Dazzling firstime users</a> is critical to getting them into your app, and actually using it. But that&#x2019;s just the first step to engagement. Retaining these hard-won users is what ultimately makes or breaks your app. The best way to make sure users stick around is to give them a better experience each time they come back.</p></div></div>",
      "date_published": "2016-10-06 14:16:39",
      "dek": null,
      "lead_image_url": "https://apptimize.com/wp-content/uploads/2016/10/hiearchy-of-engagement.jpeg",
      "title": "How to Trigger Aha! Moments Across the Customer Journey",
      "rendered_pages": 1
    }
]